code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОСостоянииСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ВыпискаОСостоянииСчетаДепо</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автоисполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьФаксимилеВОтчетах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыписки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документооборот</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПозицияВыпискиОперационныйДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияОтчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыКЭДО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
								<v8:Type>cfg:DocumentRef.СводныйОтчетОСовершенныхОперациях</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭДО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ActionType</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/AccumulationRegisters/ОстаткиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиЦБ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусЦБ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/РегистрацияДокументовКПеренумерации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияДокументовКПеренумерации</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыполненСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоДоМомента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/СтатусыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блокирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заложена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обременена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ВидыСчетовДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСчетовДепо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетДЕПО</Name>
					<Comment>Счет для учета ценных бумаг</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНФИ</Name>
					<Comment>Счет для учета финансовых инструментов, неклассифицированных как ценные бумаги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ВыпискаОСостоянииСчетаДепо/Ext/ObjectModule.bsl
Перем мТекстыЗаголовков;

///////////////////////////////////////////////////////////
// ИНТЕРФЕЙС

// BSLLS:CognitiveComplexity-off
// BSLLS:CyclomaticComplexity-off
// BSLLS:NestedStatements-off

// Формирует отчет "Выписка о состоянии счета депо"
// Параметры:
//	Отчет - ОтчетОбъект.ВыпискаОСостоянииСчетаДепо
//	БезУполномоченного - Булево
// Возвращаемое значение:
//	- ТабличныйДокумент
Функция СформироватьОтчет(Отчет, БезУполномоченного = Ложь) Экспорт
	Перем Соединение, Команда, RS;
	Перем ИсхНомер;
	
	ДатаМакета = ?(ЗначениеЗаполнено(Выписка), Выписка.Дата, ДатаВыписки);
	Отчет.Очистить();
	Документооборот	= Документооборот И ЗначениеЗаполнено(Выписка); // Для выгрузки в ЭДО требуется выписка
	
	Если Документооборот Тогда
		Если Документы.СводныйОтчетОСовершенныхОперациях.БылОтправленВЭДО(Выписка) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Документ уже был помещен в ЭДО ранее: " + Выписка;
			Сообщение.Сообщить();
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Если Справочники.Контрагенты.ОсобыеУсловия(СчетДепо.Владелец) Тогда
		Если Не РегистрыСведений.ОтветственныеЛицаОрганизаций.ПользовательМожетРедактироватьОсобыеУсловия() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Особые условия: " + СчетДепо.Владелец
			+ ". Выполнение операции доступно Ответственному за особых клиентов");
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ОтчетНаАнглийскомЯзыке = СчетДепо.Владелец.ОтчетыНаАнглийскомЯзыке;
	ИмяМакета	= ИмяМакета(ОтчетНаАнглийскомЯзыке, ДатаМакета);
	Макет		= ПолучитьМакет(ИмяМакета);
	
	Отчет.РазмерСтраницы 		= "A4";
	Отчет.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	Отчет.АвтоМасштаб			= Истина;
	
	// Подготовка подвала
	РегНомерПоручения = "";
	ДатаПоручения = "";
	Если ЗначениеЗаполнено(Выписка) И ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда
		РегНомерПоручения = СокрЛП(Выписка.ДокументОснование.ВходящийНомерПоручения);
		ДатаПоручения = Выписка.ДокументОснование.Дата;
	КонецЕсли;
	
	ИмяСекции		= "Подвал";
	ОбластьПодвала	= Макет.ПолучитьОбласть(ИмяСекции);
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ОбластьПодвала.Параметры, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	ЗаполнитьПараметрыПодвала(ОбластьПодвала, ИмяМакета, ДатаМакета, ОтчетНаАнглийскомЯзыке, РегНомерПоручения, БезУполномоченного);
	
	// Вывод шапки
	ИмяСекции	= "Шапка";
	Область		= Макет.ПолучитьОбласть(ИмяСекции);
	ЗаполнитьПараметрыШапки(Область.Параметры, ИмяМакета, ИмяСекции, ДатаМакета, ОтчетНаАнглийскомЯзыке);
	Отчет.Вывести(Область);
	
	// Вывод данных о разделе счета депо
	Ошибка = "";
	РезультатЗапроса = СформироватьЗапрос(ДатаВыписки, ПозицияВыпискиОперационныйДень, СчетДепо, Ошибка);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = Ошибка;
		Сообщение.Сообщить();
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаРазделСчетаДепо = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// Если есть остатки по ЦБ, то выведем информацию о них, иначе выведем информацию о том, что остатки нулевые
	Если ВыборкаРазделСчетаДепо.Количество() > 0 Тогда
		
		ВыборкаРазделСчетаДепо_СчетчикСтрок = 0;
		Пока ВыборкаРазделСчетаДепо.Следующий() Цикл
			ВыборкаРазделСчетаДепо_СчетчикСтрок		 = ВыборкаРазделСчетаДепо_СчетчикСтрок + 1;
			ВыборкаРазделСчетаДепо_ПоследняяСтрока	 = ВыборкаРазделСчетаДепо_СчетчикСтрок = ВыборкаРазделСчетаДепо.Количество();
			
			ИмяСекции			= "РазделСчетаДЕПО";
			ОбластьРаздела		= Макет.ПолучитьОбласть(ИмяСекции);
			ПараметрыОбласти	= ОбластьРаздела.Параметры;
			ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыОбласти, ИмяМакета, ИмяСекции,
				мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
			РазделСчетаДепо = ВыборкаРазделСчетаДепо.РазделСчетаДепо;
			ПараметрыОбласти.НомерРазделаСчетаДЕПО = СокрЛП(РазделСчетаДепо.Код);
			БезНомера = Истина;
			ПредставлениеРаздела = ОбщегоНазначенияКлиентСервер.ПредставлениеРазделаСчетаДепо(РазделСчетаДепо, ОтчетНаАнглийскомЯзыке, БезНомера);
			ПараметрыОбласти.НаименованиеРазделаСчетаДЕПО = ПредставлениеРаздела;
			
			Отчет.Вывести(ОбластьРаздела);
			
			ОбластьТело			= Макет.ПолучитьОбласть("Тело");
			ПараметрыОбласти	= ОбластьТело.Параметры;
			ВыборкаСчетДепоМХ	= ВыборкаРазделСчетаДепо.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			ВыборкаСчетДепоМХ_СчетчикСтрок = 0;
			Пока ВыборкаСчетДепоМХ.Следующий() Цикл
				ВыборкаСчетДепоМХ_СчетчикСтрок		 = ВыборкаСчетДепоМХ_СчетчикСтрок + 1;
				ВыборкаСчетДепоМХ_ПоследняяСтрока	 = ВыборкаСчетДепоМХ_СчетчикСтрок = ВыборкаСчетДепоМХ.Количество();
				
				ВыборкаРазделСчетаДепоМХ = ВыборкаСчетДепоМХ.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				ВыборкаРазделСчетаДепоМХ_СчетчикСтрок = 0;
				Пока ВыборкаРазделСчетаДепоМХ.Следующий() Цикл
					ВыборкаРазделСчетаДепоМХ_СчетчикСтрок	 = ВыборкаРазделСчетаДепоМХ_СчетчикСтрок + 1;
					ВыборкаРазделСчетаДепоМХ_ПоследняяСтрока = ВыборкаРазделСчетаДепоМХ_СчетчикСтрок = ВыборкаРазделСчетаДепоМХ.Количество();
					
					ВыборкаЦБ = ВыборкаРазделСчетаДепоМХ.Выбрать();
					
					ВыборкаЦБ_СчетчикСтрок = 0;
					Пока ВыборкаЦБ.Следующий() Цикл
						ВыборкаЦБ_СчетчикСтрок		 = ВыборкаЦБ_СчетчикСтрок + 1;
						ВыборкаЦБ_ПоследняяСтрока	 = ВыборкаЦБ_СчетчикСтрок = ВыборкаЦБ.Количество();
						ЭтоПоследняяСтрока = ВыборкаРазделСчетаДепо_ПоследняяСтрока
							И ВыборкаСчетДепоМХ_ПоследняяСтрока
							И ВыборкаРазделСчетаДепоМХ_ПоследняяСтрока
							И ВыборкаЦБ_ПоследняяСтрока;
						
						ПараметрыОбласти.ЦеннаяБумага	= ОбщегоНазначенияКлиентСервер.ПредставлениеЦБ(ВыборкаЦБ.ЦБ,
							ОтчетНаАнглийскомЯзыке);
						ПараметрыОбласти.РегНомер		= СокрЛП(ВыборкаЦБ.ЦБ.НомерРегистрации);
						ПараметрыОбласти.ISIN = СокрЛП(ВыборкаЦБ.ЦБ.ISIN);
						
						ПараметрыОбласти.Номинал = ?(ВыборкаЦБ.Номинал <> 0,
							Формат(ВыборкаЦБ.Номинал, "ЧДЦ=4; ЧН=-----") + " "
							+ СтрЗаменить(СокрЛП(ВыборкаЦБ.ВалютаНоминала), "SUR", "RUR"), "-----");
						
						ПараметрыОбласти.МХ						= СокрЛП(ВыборкаЦБ.СчетДепоМХНаименование);
						ПараметрыОбласти.РазделМХ				= СокрЛП(ВыборкаЦБ.РазделСчетаДепоМХПредставление);
						ПараметрыОбласти.КоличествоОстаток		= ВыборкаЦБ.КоличествоОстаток;
						ПараметрыОбласти.СвободноеКоличество	= ВыборкаЦБ.СвободныйОстаток;
						
						ПараметрыОбласти.ОбремененноеКоличество = ВыборкаЦБ.ОбремененныйОстаток;
						
						// Проверка на "разрыв" страницы: если подвал не вмещается на страницу, то вывести его с последней строкой таблицы на след. лист
						Если ЭтоПоследняяСтрока Тогда
							// Подготовка массива областей макета, проверяемых на потенциальный "разрыв" страницы между ними
							// области "последняя строка" последней таблицы и "подвал" таблицы должны быть на одном листе
							СтрокаСПодвалом = Новый Массив;
							СтрокаСПодвалом.Добавить(ОбластьТело);
							СтрокаСПодвалом.Добавить(ОбластьПодвала);
							ФормированиеПечатныхФорм.ВывестиГоризонтальныйРазделитель(Отчет, СтрокаСПодвалом);
						КонецЕсли;
						
						Отчет.Вывести(ОбластьТело);
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	
	Иначе	// Остатки нулевые
		ИмяСекции	= "РазделСчетаДЕПО";
		Область		= Макет.ПолучитьОбласть(ИмяСекции);
		ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(Область.Параметры, ИмяМакета, ИмяСекции,
			мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
		Отчет.Вывести(Область);
		Область = Макет.ПолучитьОбласть("Тело");
		Отчет.Вывести(Область);
	КонецЕсли;
	
	// Вывод подвала	
	Отчет.Вывести(ОбластьПодвала);
	
	Отчет.НижнийКолонтитул.Выводить = Истина;
	Отчет.НижнийКолонтитул.ТекстВЦентре = "[&НомерСтраницы] из [&СтраницВсего]";
	
	Если Документооборот Тогда
		ДокументыКЭДО.Очистить();
		
		// Поместим таблицу для клиент серверной передачи
		АдресТаблицы = ПоместитьВоВременноеХранилище(Отчет);
		
		НовыйДляЭДО = ДокументыКЭДО.Добавить();
		
		НовыйДляЭДО.Клиент				= СчетДепо.Владелец;
		НовыйДляЭДО.СчетДепо			= СчетДепо;
		НовыйДляЭДО.Документ			= Выписка;
		НовыйДляЭДО.Основание			= Выписка;
		НовыйДляЭДО.АдресТаблицы		= АдресТаблицы;
		НовыйДляЭДО.ActionType			= "INS";
		
		ПоместитьОтчетыВЭдо();
	КонецЕсли;
	
	Возврат Отчет;
КонецФункции

// Процедура заполняет реквизиты отчета основываясь на информации из документа Выписка
Процедура ЗаполнитьРеквизитыОтчетаПоВыписке() Экспорт
	Если ЗначениеЗаполнено(Выписка) Тогда
		СчетДепо = Выписка.СчетДепо;
		ДатаВыписки = Выписка.ДатаКонПериода;
		ПозицияВыпискиОперационныйДень = Выписка.ПозицияВыпискиОперационныйДень;
		
		ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		ЭлементыОтбора.Очистить();
		
		НовыйЭлемент = ЭлементыОтбора.Вставить(0, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЦенныеБумаги");
		Если ЗначениеЗаполнено(Выписка.ЦБВыписка) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение = Выписка.ЦБВыписка;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
		
		НовыйЭлемент = ЭлементыОтбора.Вставить(1, Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Эмитенты");
		Если ЗначениеЗаполнено(Выписка.ЭмитентВыписка) Тогда
			НовыйЭлемент.Использование = Истина;
			НовыйЭлемент.ПравоеЗначение = Выписка.ЭмитентВыписка;
		Иначе
			НовыйЭлемент.Использование = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// BSLLS:CognitiveComplexity-on
// BSLLS:CyclomaticComplexity-on
// BSLLS:NestedStatements-on
Процедура ПеренумероватьВыписки() Экспорт
	Если ЗначениеЗаполнено(ДатаФормированияОтчетов) И ЗначениеЗаполнено(Выписка) Тогда
		ДокОбъект = Выписка.ПолучитьОбъект();
		ДокОбъект.Дата = ДатаФормированияОтчетов;
		ДокОбъект.Записать();
		ВыполнитьПеренумерациюВыписок(ДатаВыписки);
		Если НачалоДня(ДатаВыписки) <> НачалоДня(ДатаФормированияОтчетов) Тогда
			ВыполнитьПеренумерациюВыписок(ДатаФормированияОтчетов);
		КонецЕсли;
		ДатаМакета = ?(ЗначениеЗаполнено(Выписка), Выписка.Дата, ДатаВыписки);
	КонецЕсли;	
КонецПроцедуры

///////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

Функция ИмяМакета(ОтчетНаАнглийскомЯзыке, ДатаМакета)
	
	ЗначениеПоУмолчанию = ДАТА(1, 1, 1);
	ДатаПереходаНаПечатнуюФорму2026 =
		РегистрыСведений.ПараметрыГлобальные.ЗначениеПараметра("3490.ДатаПереходаНаПечатныеФормыВыписок2026",
			ЗначениеПоУмолчанию);
	
	Если ДатаМакета >= ДатаПереходаНаПечатнуюФорму2026 Тогда
		ИмяМакета = "Макет2026";
	Иначе
		ИмяМакета = "Макет2017";
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		ИмяМакета = ИмяМакета + "en";
	КонецЕсли;
	
	Возврат ИмяМакета;
КонецФункции

Функция СформироватьЗапрос(ДатаВыписки, ПозицияВыпискиОперационныйДень, СчетДепо, Ошибка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.СчетДепоМХ КАК СчетДепоМХ,
	|	ОстаткиЦБ.СчетДепоМХ.Владелец.КодМестаХранения КАК СчетДепоМХНаименование,
	|	ОстаткиЦБ.РазделСчетаДепоМХ КАК РазделСчетаДепоМХ,
	|	ПРЕДСТАВЛЕНИЕ(ОстаткиЦБ.РазделСчетаДепоМХ) КАК РазделСчетаДепоМХПредставление,
	|	ОстаткиЦБ.СтатусЦБ КАК СтатусЦБ,
	|	ОстаткиЦБ.КоличествоОстаток КАК КоличествоОстаток,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.СтатусЦБ = &Свободна
	|			ТОГДА ОстаткиЦБ.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СвободныйОстаток,
	|	ВЫБОР
	|		КОГДА ОстаткиЦБ.СтатусЦБ В (&СтатусыОбременена)
	|			ТОГДА ОстаткиЦБ.КоличествоОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбремененныйОстаток,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.ЦБ.ВалютаНоминала КАК ВалютаНоминала,
	|	ЕСТЬNULL(НоминалЦБ.Сумма, 0) КАК Номинал
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(
	|			&Дата,
	|			СчетДепо = &СчетДепо И &УсловияОтбора) КАК ОстаткиЦБ
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&Дата) КАК НоминалЦБ 
	|		ПО ОстаткиЦБ.ЦБ = НоминалЦБ.ЦеннаяБумага
	|УПОРЯДОЧИТЬ ПО
	|	РазделСчетаДепо,
	|	СчетДепоМХ,
	|	РазделСчетаДепоМХ,
	|	ЦБ
	|ИТОГИ ПО
	|	РазделСчетаДепо,
	|	СчетДепоМХ,
	|	РазделСчетаДепоМХ");
	
	СтатусыОбременена = Новый Массив;
	СтатусыОбременена.Добавить(Перечисления.СтатусыЦБ.Обременена);
	СтатусыОбременена.Добавить(Перечисления.СтатусыЦБ.Блокирована);
	СтатусыОбременена.Добавить(Перечисления.СтатусыЦБ.Заложена);
	
	Запрос.УстановитьПараметр("Дата",		КонецДня(ДатаВыписки) - ?(ПозицияВыпискиОперационныйДень = 1, 24 * 60 * 60, 0));
	Запрос.УстановитьПараметр("СчетДепо",	СчетДепо);
	Запрос.УстановитьПараметр("Свободна",	Перечисления.СтатусыЦБ.Свободна);
	Запрос.УстановитьПараметр("СтатусыОбременена",	СтатусыОбременена);
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос, Ошибка);
	Если ЗначениеЗаполнено(Ошибка) Тогда
		Возврат Неопределено;
	Иначе
		Возврат Запрос.Выполнить();
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос, Ошибка)
	
	СравнениеЭмитент	= "(ЦБ.Эмитент ВидСравнения (&Эмитент)	ИЛИ &НеПроверятьЭмитента)";
	СравнениеЦБ			= "(ЦБ ВидСравнения (&ЦБ)				ИЛИ &НеПроверятьЦБ)";
	
	СписокЭмитентов		= Новый СписокЗначений;
	СписокЦБ			= Новый СписокЗначений;
	
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		ЛевоеЗначение = СокрЛП(ЭлементОтбора.ЛевоеЗначение);
		Если ЭлементОтбора.Использование Тогда
			МаскаУсловия = МаскаУсловия(ЭлементОтбора.ВидСравнения);
			Если НЕ ЗначениеЗаполнено(МаскаУсловия) Тогда
				Ошибка = "Неверный вид сравнения в отборе.";
				Возврат;
			КонецЕсли;
			
			Если ЛевоеЗначение = "ЦенныеБумаги" Тогда
				СравнениеЦБ = УсловиеСравнения(СравнениеЦБ, Запрос, МаскаУсловия, ЭлементОтбора, "ЦБ",
					Справочники.ЦенныеБумаги.ПустаяСсылка(), "НеПроверятьЦБ", "ЦБ");
				
			ИначеЕсли ЛевоеЗначение = "Эмитенты" Тогда
				СравнениеЭмитент = УсловиеСравнения(СравнениеЭмитент, Запрос, МаскаУсловия, ЭлементОтбора, "ЦБ.Эмитент",
					Справочники.Контрагенты.ПустаяСсылка(), "НеПроверятьЭмитента", "Эмитент");
			КонецЕсли;
		Иначе
			Если ЛевоеЗначение = "ЦенныеБумаги" Тогда
				СравнениеЦБ	= СтрЗаменить(СравнениеЦБ, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("ЦБ",				СписокЦБ);
				Запрос.УстановитьПараметр("НеПроверятьЦБ",	Истина);
			
			ИначеЕсли ЛевоеЗначение = "Эмитенты" Тогда
				СравнениеЭмитент = СтрЗаменить(СравнениеЭмитент, "ВидСравнения", "В");
				Запрос.УстановитьПараметр("Эмитент",				СписокЭмитентов);
				Запрос.УстановитьПараметр("НеПроверятьЭмитента",	Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	УсловияОтбора = "" + СравнениеЦБ + Символы.ПС
					+ " И " + СравнениеЭмитент;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", УсловияОтбора);
	
КонецПроцедуры

Функция МаскаУсловия(ВидСравнения)
	
	Если ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии Тогда
		МаскаУсловия = "В ИЕРАРХИИ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.НеВИерархии
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке
			ИЛИ ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии Тогда
		МаскаУсловия = "НЕ В ИЕРАРХИИ";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено Тогда
		МаскаУсловия = "НЕ ЕСТЬ NULL";
	ИначеЕсли ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
		МаскаУсловия = "ЕСТЬ NULL";
	Иначе
		МаскаУсловия = "";
	КонецЕсли;
	Возврат МаскаУсловия;
	
КонецФункции

Функция УсловиеСравнения(ТекстСравнения, Запрос, МаскаУсловия, эл, ИмяПоля,	ПустаяСсылка, НеПроверятьПоле, ИмяПараметра)
	
	Если МаскаУсловия = "НЕ ЕСТЬ NULL" Тогда
		ТекстСравнения	= "(НЕ %ИмяПоля ЕСТЬ NULL
			| ИЛИ НЕ %ИмяПоля = НЕОПРЕДЕЛЕНО
			| ИЛИ НЕ %ИмяПоля = &%ПустаяСсылка
			| ИЛИ &%НеПроверятьПоле)";
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ИмяПоля", ИмяПоля);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ПустаяСсылка", ИмяПараметра + "ПустаяСсылка");
		Запрос.УстановитьПараметр(ИмяПараметра + "ПустаяСсылка", ПустаяСсылка);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%НеПроверятьПоле", НеПроверятьПоле);
	ИначеЕсли  МаскаУсловия = "ЕСТЬ NULL" Тогда
		ТекстСравнения	= "(%ИмяПоля ЕСТЬ NULL
			| ИЛИ %ИмяПоля = НЕОПРЕДЕЛЕНО
			| ИЛИ %ИмяПоля = &%ПустаяСсылка
			| ИЛИ &%НеПроверятьПоле)";
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ИмяПоля", ИмяПоля);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%ПустаяСсылка", ИмяПараметра + "ПустаяСсылка");
		Запрос.УстановитьПараметр(ИмяПараметра + "ПустаяСсылка", ПустаяСсылка);
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "%НеПроверятьПоле", НеПроверятьПоле);
	Иначе
		ТекстСравнения = СтрЗаменить(ТекстСравнения, "ВидСравнения", МаскаУсловия);
	КонецЕсли;
	Запрос.УстановитьПараметр(ИмяПараметра,		эл.ПравоеЗначение);
	Запрос.УстановитьПараметр(НеПроверятьПоле,	Ложь);
	Возврат ТекстСравнения;
	
КонецФункции

Процедура ЗаполнитьПараметрыШапки(ПараметрыШапки, ИмяМакета, ИмяСекции, ДатаМакета, ОтчетНаАнглийскомЯзыке)
	
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыШапки, ИмяМакета, ИмяСекции,
		мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	
	Если СтрНайти(ИмяМакета, "Макет2017") > 0 Тогда
		Инфо = ФормированиеПечатныхФорм.ИнформацияОДепозитарии(ДатаВыписки, СчетДепо.ВидСчетаДепо) + Символы.ПС
			+ Символы.ПС + ФормированиеПечатныхФорм.ИнформацияОДепозитарииНаАнглийском(ДатаВыписки, СчетДепо.ВидСчетаДепо);
		ПараметрыШапки.ИнформацияОДепозитарии = Инфо;
	КонецЕсли;
	
	ПараметрыШапки.ТипОперации = ТипОперации(СчетДепо.ВидСчетаДепо, "Русский");
	Если ОтчетНаАнглийскомЯзыке Тогда
		ПараметрыШапки.ТипОперацииНаАнглийском = ТипОперации(СчетДепо.ВидСчетаДепо, "Английский");
	КонецЕсли;
	
	Если ВидЗапроса = "Депонентов" Тогда
		Если ЗначениеЗаполнено(Выписка) И ЗначениеЗаполнено(Выписка.ДокументОснование) И (ЗначениеЗаполнено(Выписка.ДокументОснование.Инициатор)
			И (ТипЗнч(Выписка.ДокументОснование.Инициатор) = Тип("СправочникСсылка.Контрагенты")
			ИЛИ ТипЗнч(Выписка.ДокументОснование.Инициатор) = Тип("СправочникСсылка.Организации"))) Тогда
			ПараметрыШапки.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(Выписка.ДокументОснование.Инициатор, ОтчетНаАнглийскомЯзыке);
		Иначе
			ПараметрыШапки.ИнициаторОперации = ОбщегоНазначенияКлиентСервер.НаименованиеКлиента(СчетДепо.Владелец, ОтчетНаАнглийскомЯзыке);
		КонецЕсли;
	КонецЕсли;
	
	Если ПозицияВыпискиОперационныйДень = 1 Тогда
		ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыШапки, "По", ДатаВыписки);
	Иначе
		ФормированиеПечатныхФорм.СформироватьДатуДДММГГ(ПараметрыШапки, "На", ДатаВыписки);
	КонецЕсли;
	
	Если ВидЗапроса = "Депонентов" Тогда
		ПараметрыШапки.ВидЗапроса = "Запрос от депонента";
	ИначеЕсли ВидЗапроса = "ВМХ" Тогда
		ПараметрыШапки.ВидЗапроса = "Запрос от вышестоящих мест хранения";
	ИначеЕсли ВидЗапроса = "ГОДЗ" Тогда
		ПараметрыШапки.ВидЗапроса = "Запрос от гос. или иных органов по законодательству";
	КонецЕсли;
	
	Если ОтчетНаАнглийскомЯзыке Тогда
		ВидЗапросаНаАнглийском = "";
		Если ВидЗапроса = "Депонентов" Тогда
			ВидЗапросаНаАнглийском = " / Inquiry from the depositor";
		ИначеЕсли ВидЗапроса = "ВМХ" Тогда
			ВидЗапросаНаАнглийском = " / Request from higher depositaries";
		ИначеЕсли ВидЗапроса = "ГОДЗ" Тогда
			ВидЗапросаНаАнглийском = " / Inquiry from public institutions under the law";
		КонецЕсли;
		ПараметрыШапки.ВидЗапроса = ПараметрыШапки.ВидЗапроса + ВидЗапросаНаАнглийском;
	КонецЕсли;
	ПараметрыШапки.НомерСчетаДЕПО = СокрЛП(СчетДепо.Код);
	
	ПараметрыШапки.НаименованиеДепонента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
		СчетДепо.Владелец, ДатаМакета, ОтчетНаАнглийскомЯзыке);
	ПараметрыШапки.ДокументыДепонента = ОбщегоНазначенияКлиентСервер.ДокументКлиента(СчетДепо.Владелец,	ДатаМакета);
	
	Если ЗначениеЗаполнено(СчетДЕПО) Тогда
		Если РегистрыСведений.КлиентыСУчетомНаСчетахТипаC.ЦБКлиентаУчитываютсяНаСчетеТипаС(ДатаВыписки, СчетДепо.Владелец) Тогда
			ТипСчетаДепо = "" + СчетДЕПО.ТипСчетаДепо + " типа С";
		Иначе
			ТипСчетаДепо = СчетДЕПО.ТипСчетаДепо;
		КонецЕсли;
		ПараметрыШапки.НаименованиеСчетаДЕПО =
			?(ОтчетНаАнглийскомЯзыке,
				ПереводТекстаНаДругиеЯзыки.ДополнитьТекстПереводом(ТипСчетаДепо), СокрЛП(ТипСчетаДепо));
	Иначе
		ПараметрыШапки.НаименованиеСчетаДЕПО = "";
	КонецЕсли;
	
КонецПроцедуры

Функция ТипОперации(ВидСчетаДепо, Язык)
	
	Тип = "";
	Если Язык = "Русский" Тогда
		Тип = "Формирование выписки о состоянии счета депо";
	ИначеЕсли Язык = "Английский" Тогда
		Тип = "Generation of custody account status statement";
	КонецЕсли;
	Возврат Тип;
	
КонецФункции

Процедура ЗаполнитьПараметрыПодвала(ОбластьПодвала, ИмяМакета, ДатаМакета, ОтчетНаАнглийскомЯзыке, РегНомерПоручения, БезУполномоченного)
	
	ОтветственноеЛицо = ПараметрыСеанса.ТекущийПользователь;
	РисункиПодвала = ОбластьПодвала.Рисунки;
	ПараметрыПодвала = ОбластьПодвала.Параметры;
	
	Если БезУполномоченного Тогда
		РисункиПодвала.Faksimilie.Картинка	= Новый Картинка;
	Иначе
		// Получить факсимилье
		Если ВыводитьФаксимилеВОтчетах И Не Документооборот Тогда
			ФормированиеПечатныхФорм.ПолучитьФаксимилье(ОтветственноеЛицо.ФизЛицо, РисункиПодвала.Faksimilie.Картинка);
		Иначе
			РисункиПодвала.Faksimilie.Картинка	= Новый Картинка;
		КонецЕсли;
		
		ФИООтветственногоЛица = ?(ОтветственноеЛицо.ФизЛицо = Неопределено, ОтветственноеЛицо.ПолноеНаименование(),
			ОтветственноеЛицо.ФизЛицо);
		
		ПараметрыПодвала.ФИО = Строка(ФИООтветственногоЛица);
		
		Если ОтчетНаАнглийскомЯзыке Тогда
			ПараметрыПодвала.ФИО = ПараметрыПодвала.ФИО + " / "
				+ ОбщегоНазначенияКлиентСервер.Транслит(ФИООтветственногоЛица);
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выписка) И ЗначениеЗаполнено(Выписка.ДокументОснование) Тогда
		ПараметрыПодвала.Поручение = ОбщегоНазначенияКлиентСервер.ДокументОснованиеСтрокой(Выписка.ДокументОснование, ОтчетНаАнглийскомЯзыке);
		ПараметрыПодвала.ДопИнформация = СокрЛП(Выписка.ДокументОснование.Комментарий);
	КонецЕсли;
	
	ДатаОтчета = ?(ЗначениеЗаполнено(ДатаФормированияОтчетов), ДатаФормированияОтчетов, Выписка.Дата);
	ФормированиеПечатныхФорм.СформироватьДатуВремяДДММГГЧЧММ(ПараметрыПодвала, "", ДатаОтчета);
	
	ФормированиеПечатныхФорм.УстановитьЗаголовкиСекцииМакета(ПараметрыПодвала, ИмяМакета, "Подвал", мТекстыЗаголовков, СчетДепо.ВидСчетаДепо);
	
	Если СчетДепо.ВидСчетаДепо = Перечисления.ВидыСчетовДепо.СчетДЕПО Тогда
		ПараметрыПодвала.РеквизитыПриказа = РегистрыСведений.РеквизитыПриказовПриложенийКРДО.Реквизиты(ДатаМакета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоместитьОтчетыВЭдо() Экспорт // BSLLS:Typo-off
	
	ТипДокумента = "DepoAccountState";
	
	ФормированиеОтчетовОСовершенныхОперациях = Обработки.ФормированиеОтчетовОСовершенныхОперациях.Создать();
	ФормированиеОтчетовОСовершенныхОперациях.ПоместитьОтчетыВKafka(ТипДокумента, ДокументыКЭДО, ВыводитьФаксимилеВОтчетах);
	
	Для Каждого СтрокаРезультата Из ДокументыКЭДО Цикл
		Если ЗначениеЗаполнено(СтрокаРезультата.ТекстОшибки) Тогда
			ШаблонОшибки = "Отчет [%1] по счету депо [%2] не отправлен в ЭДО по причине: %3";
			ТекстОшибки = СтрШаблон(ШаблонОшибки, ТипДокумента, СокрЛП(СтрокаРезультата.СчетДепо), СтрокаРезультата.ТекстОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьПеренумерациюВыписок(ДатаПеренумерации)
	
	ОбработкаПеренумерации = Обработки.ПеренумерацияДокументов.Создать();
	ВыборкаРег = РегистрыСведений.РегистрацияДокументовКПеренумерации.Выбрать(НачалоДня(ДатаПеренумерации), КонецДня(ДатаПеренумерации));
	Пока ВыборкаРег.Следующий() Цикл
		Если ВыборкаРег.ИмяДокумента = "Выписка" Тогда
			ОбработкаПеренумерации.ПеренумероватьДокументы(ВыборкаРег);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

мТекстыЗаголовков = ФормированиеПечатныхФорм.ТекстыЗаголовковОтчетов(ПолучитьМакет("Заголовки").ПолучитьТекст());
ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
